using System;

namespace idk_why__it_s_just_existing
{
    class Program
    {
        static void Main()
        {
            for (int i = 5; i <= 96; i += 7)
            {
                Console.Write(i + " ");
            }
            /* Цикл for был выбран потому, что с его помощью легко выводить закономерные последовательности чисел, одна из которых и была представлена в задании.
             * Нужно было только выявить эту самую закономерность и подставить в цикл.
             */
        }
    }
}
