using System;

namespace idk_why__it_s_just_existing
{
    class Program
    {
        static void Main()
        {
            Console.SetWindowSize(163, 40);

            int crystalPrice = 15;
            int playerMoney;
            int playerCrystals;
            int possibleCrystals;

            Console.Write("Вы попадаете в город дварфов. Перед вами открывается красивейший вид на высотки и механические цехи, " +
                "выглядящие как верхушка инженерного искусства. \n\nВас окликивает стражник: <<Хэй, ты выглядишь как авантюрист " +
                "и надо понимать за душой у тебя ни грамма кристаллов. В Крауцгерте это основная валюта, так что можешь пройти в обменник, " +
                "чтобы поменять свои золотые монеты на шилды, так называется сдешняя валюта. Тебе прямо, а там в маленькое здание справа, не потеряешься.>> " +
                "\n\nВы проходите в низенькую одноэтажку с вывеской <<Обменник>> и вас встречает низкий, даже по сдешним меркам, дварф с густыми бровями. " +
                "\n<<Приветствую вас в Крауцгертском обменнике, дорогой авантюрист. Сколько монет с собой имеете?>> ");

            playerMoney = Convert.ToInt32(Console.ReadLine());
            possibleCrystals = playerMoney / crystalPrice;

            Console.Write("Так вот какие деньги сейчас получают авантуристы... Интересненько... За ваши {0} монет я могу предложить вам " +
                "до {1} шилдов, так как 1 шилд стоит {2} монет. \nНа сколько кристаллов вы хотите обменять своё золото? ", playerMoney, possibleCrystals, crystalPrice);

            playerCrystals = Convert.ToInt32(Console.ReadLine());
            playerMoney -= playerCrystals * crystalPrice;

            Console.WriteLine("Как вам угодно. Всего доброго. \nВы покидаете обменник, готовые к покорению Крауцгерта. Ваш баланс на данный момент: " +
                "\nШилды: {0} \nМонеты: {1}", playerCrystals, playerMoney);

            if (playerMoney < 0)
            {
                Console.WriteLine("Вы взяли долг в обменнике, так что вам пришлось пойти работать в шахты, чтобы его отработать. " +
                    "В этих же шахтах вы и умерли от вывиха лодыжки");
            }

        }
    }
}
